questions = [
    {
        "quest" : "Сколько планет в солнечной системе?",
        "answers" : ["5", "6", "7", "8"],
        "right" : "8"
    },
    {
        "quest" : "Кто основал Apple?",
        "answers" : ["Джобс", "Хоккинг", "Гейстс", "Ньюэл"],
        "right" : "Джобс"
    },
    {
        "quest" : "Чему равно Пи?",
        "answers" : ["4.44", "6", "3.14", "31.4"],
        "right" : "3.14"
    },
    {
        "quest" : "Кого любит Максим",
        "answers" : ["Мотоблок", "Настю", "Славу", "Никиту"],
        "right" : "Настю"
    },
    {
        "quest" : "какой уровень у меганайта не прокачивая его?",
        "answers" : ["8", "10", "11", "9"],
        "right" : "9"
    }
]